package lab4;

/**
 * Created by Alexey on 10.09.2017.
 */
public class Main {

    /**
     * На основе генераторов из предыдущей лабораторной, реализовать генерацию распределений,
     * отличных от равномерного: нормальное распределение, распределение 3. Пуассона,
     * Вейбула и экспоненциальное распределение.
     * Распределить работу между несколькими нитями.
     * Протестировать программу, нарисовав гистограмму распределений, а также вычислив эмпирическое
     * математическое ожидание и эмпирическую дисперсию, сравнив их с теоретическими значениями
     * для соответствующих распределений.     */
    public static void main(String[] args){

    }
}
